
<div style="direction:ltl;line-height:150%;"><font face="B Nazanin" size=3>
<font color=#007E06 size=3>
    <h1>PANDAS</h1>
</font>
Description:

Learn the basics of Pandas for data analysis in Jupyter! This notebook covers :

&nbsp;&nbsp;&nbsp;&nbsp;-Loading & exploring data

&nbsp;&nbsp;&nbsp;&nbsp;-Data cleaning & manipulation

&nbsp;&nbsp;&nbsp;&nbsp;-Essential functions (filtering, grouping, aggregations)

&nbsp;&nbsp;&nbsp;&nbsp;-Simple visualizations

Perfect for beginners! ðŸš€
<font size=4 >
 
</font>
</div>

In [47]:
import pandas as  pd
import numpy as np

In [30]:
#ÛŒÚ© Ú©ØªØ§Ø¨Ø®Ø§Ù†Ù‡ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ù†ÛŒÙ… Ú©Ù„Ø§
df = pd.DataFrame(
    {
        "Name" : ["Hamid","ALi","Marzie"],
        "Age"  : [  22,    30,     18   ],
        "Sex"  : ["male","male","female"]
    }
)
(df.describe(include='number'))#for numberical data

             Age
count   3.000000
mean   23.333333
std     6.110101
min    18.000000
25%    20.000000
50%    22.000000
75%    26.000000
max    30.000000

In [31]:
#how to save dataframe:
#df.to_csv("mydf.csv")
#df.to_csv("mydf.csv",index=False) 
#index=False: It can be saved without an index.

In [32]:
(df.describe(include='all'))#for both numberical and textual data

         Name        Age   Sex
count       3   3.000000     3
unique      3        NaN     2
top     Hamid        NaN  male
freq        1        NaN     2
mean      NaN  23.333333   NaN
std       NaN   6.110101   NaN
min       NaN  18.000000   NaN
25%       NaN  20.000000   NaN
50%       NaN  22.000000   NaN
75%       NaN  26.000000   NaN
max       NaN  30.000000   NaN

In [33]:
df.describe() #summary description

             Age
count   3.000000
mean   23.333333
std     6.110101
min    18.000000
25%    20.000000
50%    22.000000
75%    26.000000
max    30.000000

In [34]:
(df["Name"])

0     Hamid
1       ALi
2    Marzie
Name: Name, dtype: object

In [35]:
df['Age'].max()

np.int64(30)

In [36]:
s = pd.Series(np.random.randn(10))
print(s,'\n----------')
(s[::2],'inew')

0    0.024504
1   -0.575678
2   -0.431381
3   -1.223369
4   -0.358867
5    0.670683
6   -0.491257
7    0.213860
8    1.075540
9    1.513974
dtype: float64
----------

(0    0.024504
 2   -0.431381
 4   -0.358867
 6   -0.491257
 8    1.075540
 dtype: float64,
 'inew')

In [37]:
s.describe()

count    10.000000
mean      0.041801
std       0.837445
min      -1.223369
25%      -0.476288
50%      -0.167182
75%       0.556478
max       1.513974
dtype: float64

<div style="direction:ltl;line-height:150%;"><font face="B Nazanin" size=3>
<font color=#007E06 size=3>
</font>
ÛŒÚ© Ø³ØªÙˆÙ† Ø¨Ø³Ø§Ø²ÛŒÙ… Ø¯Ø± Ø­Ø§Ù„Øª Ú©Ù„ÛŒ:
<font size=4 >
 
</font>
</div>

In [38]:
a = pd.Series([34,23,56,34,30,47], name = "integer number")
a

0    34
1    23
2    56
3    34
4    30
5    47
Name: integer number, dtype: int64

<div style="direction:ltl;line-height:150%;"><font size=3>
<font color=#007E06 size=3>
</font>
next cell create : 10 row , 5 col , naming col                                                   
    
pd.DataFrame((import data),columns=[..])                                                          
np.random.randn(row,col)<font size=4 >
 
</font>
</div>

In [39]:
d = pd.DataFrame(np.random.randn(10,5),columns=['a','b','c','d','e'])
d

          a         b         c         d         e
0  0.070573 -0.647584  0.376528 -1.227082 -1.466285
1 -0.116598  0.438351  0.000461 -0.140823 -1.581332
2 -0.222414 -0.664235 -0.712112  1.134879  0.771900
3  0.450481 -1.459622 -0.953541  0.801474 -0.372754
4 -1.085471 -1.764386 -0.029302  1.820168 -1.633504
5  1.125330  0.434514  1.986977  0.027751 -0.370689
6 -0.172276 -0.034073  1.167105 -1.162426 -2.547957
7  1.840024 -0.478462  0.421504  0.237245 -0.299610
8 -1.728488  0.207546 -1.133019  1.568037 -1.569851
9  0.128129  1.454365  0.191075  0.070401  1.152926

In [40]:
d.idxmin(axis=1) # Ø§Ù†Ø¯ÛŒØ³ Ø¨Ø²Ø±Ú¯ØªØ±ÛŒÙ† Ø¹Ø¯Ø¯ Ø±Ùˆ Ø¯Ø± Ù‡Ø± Ø³Ø·Ø± Ø¨Ø¯Ø³Øª Ø¨ÛŒØ§Ø±

0    e
1    e
2    c
3    b
4    b
5    e
6    e
7    b
8    a
9    d
dtype: object

In [41]:
d.idxmin(axis=0)#Ø§Ù†Ø¯ÛŒØ³  Ú©Ù…ØªØ±ÛŒÙ† Ø¹Ø¯Ø¯ Ø±Ùˆ Ø¯Ø± Ù‡Ø± Ø³ØªÙˆÙ† Ø¨Ø¯Ø³Øª Ø¨ÛŒØ§Ø±

a    8
b    4
c    8
d    0
e    6
dtype: int64

In [42]:
d.describe()

               a          b          c          d          e
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.028929  -0.251359   0.131568   0.312962  -0.791716
std     1.007013   0.956940   0.954172   1.036094   1.168974
min    -1.728488  -1.764386  -1.133019  -1.227082  -2.547957
25%    -0.209880  -0.660072  -0.541409  -0.098679  -1.578462
50%    -0.023012  -0.256268   0.095768   0.153823  -0.919520
75%     0.369893   0.377772   0.410260   1.051528  -0.317380
max     1.840024   1.454365   1.986977   1.820168   1.152926

create col that have 'nan' value:

In [43]:
pd.Series(['a',np.nan,'a','a',30,'a','b','b',np.nan,'d',34])

0       a
1     NaN
2       a
3       a
4      30
5       a
6       b
7       b
8     NaN
9       d
10     34
dtype: object

In [44]:
a = pd.Series(np.random.randn(5))
a

0    0.766843
1   -0.158954
2   -0.487754
3   -1.746527
4   -0.993250
dtype: float64

<div> 
    <font size = 3 face = 'Sans-Serif' >
        argmin and argmax in numpy = idxmin and idxmax in pandas !
    </font>
</div>

In [45]:
a.idxmax() #Ø§Ù†Ø¯ÛŒØ³ Ø¨Ø²Ø±Ú¯ØªØ±ÛŒÙ† Ø±Ø§ Ø¨Ø±Ù…ÛŒÚ¯Ø±Ø¯Ø§Ù†Ø¯

0

In [46]:
a.idxmin() #Ø§Ù†Ø¯ÛŒØ³ Ú©ÙˆÚ†ÛŒÚ© ØªØ±ÛŒÙ† Ø±Ø§ Ø¨Ø±Ù…ÛŒÚ¯Ø±Ø¯Ø§Ù†Ø¯

3